# [Corriger les défauts d'alignement par formule Python](https://www.youtube.com/watch?v=WIIVgRbLRK4&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=13)

Date : 13/05/2025

In [1]:
import pandas as pd

In [3]:
tab = pd.read_excel('data/Strip.xlsx')

In [4]:
tab.head()

                  Nom  Prime
0      Onète Marie     17300
1        Orange Jude   11900
2      Loupe Sacha     14700
3      Vire Sacha      16600
4     Lipe Sophie       6700

In [5]:
tab.assign(Nom=tab['Nom'].str.strip())[['Prime', 'Nom']]

    Prime                 Nom
0   17300         Onète Marie
1   11900         Orange Jude
2   14700         Loupe Sacha
3   16600          Vire Sacha
4    6700         Lipe Sophie
5    6200         Mimi Mathis
6   14200     Strofobe Claude
7    5500     Manletan Gérard
8   15100           Cow Harry
9    3500         Sisse Médhi
10   4700          Remor Yves
11   3200       Feuline Laure
12  12300        Hoquet Clara
13   2300  Yhaubert Jean Loup
14  19400         Kiche Loren
15   2300    Veublouse Agathe